# ԽՆԴՐԻ ՆԿԱՐԱԳՐՈՒԹՅՈՒՆԸ ՏԵՍ ՆԵՐՔԵՎՈՒՄ
# Գրել bash սկրիպտ, որը որպես արգումենտ ստանում է թիվ և աշխատեցնելուց
# էկրանին նկարում եռանկյունատիպ պատկեր փոխանցված արգումենտի պարամետրով։
# Օրինակ՝ սկրիպտը 5֊ով աշխատեցնելու դեպքում սպասվող արդյունքը հետևյալն է․
#     *
#    **
#   ***
#  ****
# *****
# Խնդիրը սկսելուց առաջ համոզվիր որ պահանջը պարզ է։

#!/bin/bash
echo "Enter tree length"
read rows
t=$rows
for (( i=0; i<$rows; i++ ))
do
  tub=""
  for (( j=$rows - i; j>1; j-- ))
  do
        tub+=" "   
  done
  x=$(($i+1))
  while [ $x -ge 1 ]  
  do 
   tub+="*"
   x=$((x-1))
  done
  
  echo "$tub"
done
